{
  "backend/main.mo": "Minimal Motoko actor with comments explaining domain configuration via VITE_PUBLIC_SITE_URL.",
  "feature_evidence.json": "Feature evidence report mapping domain‑config tasks to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-style list summarizing key frontend files and their roles in styling, SEO, config, and UI components.",
  "frontend/.env.example": "Example environment file documenting VITE_PUBLIC_SITE_URL format and fallback behavior.",
  "frontend/DOMAIN_CONFIGURATION.md": "Guide explaining how to set VITE_PUBLIC_SITE_URL with step‑by‑step configuration instructions and verification steps.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variants, and global element styling.",
  "frontend/index.html": "App entry HTML with script that normalizes VITE_PUBLIC_SITE_URL and generates canonical and og:url tags.",
  "frontend/src/App.tsx": "Main SPA layout combining Header, Hero, Services, About, and Footer sections.",
  "frontend/src/components/marketing/AboutSection.tsx": "About section with animated reveals, company intro, image, and value list.",
  "frontend/src/components/marketing/Footer.tsx": "Footer with company info, quick links, contact details, animations, and hostname-based UTM tracking.",
  "frontend/src/components/marketing/Header.tsx": "Responsive header with scroll detection, smooth section navigation, and mobile menu toggle.",
  "frontend/src/components/marketing/HeroSection.tsx": "Landing hero with animated text, background image overlays, CTA buttons, and stat highlights.",
  "frontend/src/components/marketing/SectionReveal.tsx": "Wrapper component that animates children into view once using an intersection observer.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Services grid section displaying service cards with icons and reveal animations on scroll.",
  "frontend/src/config/siteUrl.ts": "Utility functions for resolving the public site origin and building absolute URLs using an optional env variable.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hooks for managing Internet Identity login, stored identities, and status tracking.",
  "frontend/src/hooks/useInViewOnce.ts": "Hook that uses an IntersectionObserver to mark an element as in-view once and trigger animations.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, base typography, animations, and accessibility/transition utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins.",
  "project_state.json": "Stores project metadata, feature lists, and pending requests for domain‑configuration work."
}