{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Single-source configurable public site domain (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Introduce a single configurable source of truth for the public site URL and use it for absolute-URL metadata with safe fallbacks.",
      "acceptanceCriteria": [
        "A developer can set the site’s public domain in one place (e.g., an env var or a small config module) without hunting for hard-coded domains.",
        "Any absolute-URL metadata (canonical/OG URL if present or added) uses the configured domain.",
        "When no domain is configured, the site still works correctly (e.g., falls back to current origin or uses relative URLs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/siteUrl.ts",
          "operation": "create",
          "description": "Create a small config module that reads a single public site URL setting (e.g., from a build-time env var) and provides helpers like `getPublicSiteOrigin()` and `toAbsoluteUrl(path)` with fallback to `window.location.origin`. Include brief inline comments describing intended usage."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add/adjust SEO/share metadata to use the configured public domain: include canonical and OG URL (and any required supporting tags) sourced from the single configuration value, with a runtime fallback to the current origin when the value is not set."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Audit and refactor hard-coded domain/host references to use relative URLs or the new domain configuration.",
      "acceptanceCriteria": [
        "No user-facing links or asset URLs depend on a specific hard-coded domain.",
        "All internal navigation and static asset references continue to work after changing the configured domain."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/Footer.tsx",
          "operation": "modify",
          "description": "Replace any domain/host-dependent link construction with the new site URL helpers (e.g., use configured hostname/origin where appropriate, otherwise rely on relative URLs/current origin) so the component does not implicitly depend on a specific deployed domain."
        },
        {
          "path": "frontend/src/components/marketing/Header.tsx",
          "operation": "modify",
          "description": "Audit for any hard-coded host/domain usage (including link targets) and refactor to use relative URLs or the shared site URL configuration helpers as appropriate."
        },
        {
          "path": "frontend/src/components/marketing/HeroSection.tsx",
          "operation": "modify",
          "description": "Audit for any hard-coded host/domain usage (including link targets) and refactor to use relative URLs or the shared site URL configuration helpers as appropriate."
        },
        {
          "path": "frontend/src/components/marketing/AboutSection.tsx",
          "operation": "modify",
          "description": "Audit for any hard-coded host/domain usage (including link targets) and refactor to use relative URLs or the shared site URL configuration helpers as appropriate."
        },
        {
          "path": "frontend/src/components/marketing/ServicesSection.tsx",
          "operation": "modify",
          "description": "Audit for any hard-coded host/domain usage (including icon/asset references if any are absolute) and refactor to use relative URLs or the shared site URL configuration helpers as appropriate."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add developer documentation describing how to change the deployed site domain and verify it is applied.",
      "acceptanceCriteria": [
        "Documentation clearly states where to set the domain and how to verify it is applied.",
        "Documentation is written in English."
      ],
      "file_operations": [
        {
          "path": "frontend/DOMAIN_CONFIGURATION.md",
          "operation": "create",
          "description": "Document how to set the public site domain in one place (the chosen env var/config module), what the value affects (canonical/OG URL and any absolute URL generation), and how to verify behavior with and without the value configured (fallback to current origin)."
        }
      ]
    }
  ]
}